In [29]:
#fisrt we will extract the extract the file
# use index_col=0 to delete the automatic index from pandas  

import pandas as pd 
AICC =  pd.read_csv('Temperature Jouzel AICC.csv', index_col=0)
AICC

         ztop   EDC3béta      AICC2012 deutfinal   temp acc-EDC3beta
bag
1           0        -50           -55       NaN  218,3     3,105321
2        0,55  -43,55977  -50,51333333       NaN  218,3     3,104805
3         1,1  -37,44019  -46,02666667       NaN  218,3     3,104404
4        1,65  -31,64156        -41,54       NaN  218,3     3,104025
5         2,2  -24,55278  -34,51666667       NaN  218,3     3,103453
...       ...        ...           ...       ...    ...          ...
5815   3197,7   816871,6        817562    -432,2    211        1,529
5816  3198,25   817693,6        818631    -431,4  211,2        1,548
5817   3198,8   818505,5        819700    -430,3  211,3        1,576
5818  3199,35   819303,1        820769    -429,8  211,4        1,589
5819   3199,9   820093,9        821838      -430  211,4        1,583

[5819 rows x 6 columns]

In [36]:
#extract 2 columns from dataset Temperature & AICC2012 which represents the years 
df = AICC[['temp', 'AICC2012']]
df

       temp      AICC2012
bag
1     218,3           -55
2     218,3  -50,51333333
3     218,3  -46,02666667
4     218,3        -41,54
5     218,3  -34,51666667
...     ...           ...
5815    211        817562
5816  211,2        818631
5817  211,3        819700
5818  211,4        820769
5819  211,4        821838

[5819 rows x 2 columns]

In [39]:
#now we will follow the same steps to extract the CO2 ppmv & Gasage (yr BP)
#add skiprows because the first 14 rows are sentences with numbers and they are being printed in the querry as well 
import pandas as pd

CO2 = pd.read_csv('CO2 Composite.csv',skiprows=14)
dff = CO2[['Gasage (yr BP)' , 'CO2 (ppmv)']]
dff

     Gasage (yr BP) CO2 (ppmv)
0            -51,03     368,02
1            -48,00     361,78
2            -46,28     359,65
3            -44,41     357,11
4            -43,08     353,95
...             ...        ...
1896      803925,28     202,92
1897      804009,87     207,50
1898      804522,67     204,86
1899      805132,44     202,23
1900      805668,87     207,29

[1901 rows x 2 columns]